// 자료 구조

// data : int, float, char *, &, [] struct, class

// 자료 : 기본 자료형, 복합 자료형
// 기본 자료형 : int, float, double, char... 프로그래밍 언어를 사용하기 위한 기본
// 복합 자료형 : 기본 자료형으로 표현하기 힘든 자료형을 새롭게 정의

// 자료 구조 : 데이터를 잘 사용하기 위해서 분류하는 것
// 시간, 공간

// 자료구조의 분류 : 선형 자료구조, 비선형 자료구조

// 0. 배열 : 포인터. 포인터의 연산 - 배열 (ptr+1) arr[0+1]
// 배열의 특징 : 연속적인 메모리 공간에 저장된다.

// ADT (abstract data type) 추상 데이터 형식
// 자료형(가변배열) : 배열인데 길이를 변경할 수 있는 배열
// 자료구조는 같은 종류라도 다양한 클래스 존재
// 호환성 : 버전이 변경되도 기존 기능 제공
// 직접 자료구조를 만드는 경우는 드물다. STL(Standard Template Library)

// 1. 가변 배열(vector)
// 2. 연결 리스트(linked list
// 3. 스택, 큐
// 4. 힙

// 5. 트리
// 6. 그래프